examples/prelim0/openfoam/multiRegionHeater/system/heater/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    minY
    {
        type            patch;
        inGroups        (coupleGroup);
    }
}

T
{
    internalField   uniform 323;

    boundaryField
    {
        ".*"
        {
            type            zeroGradient;
        }

        heater_to_topAir
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            value           uniform 323;
        }

        minY
        {
            type            fixedValue;
            value           uniform 323;
        }
    }
}

// ************************************************************************* //
